In [1]:
import pandas as pd

In [2]:
import quandl

In [22]:
api_key = open('ApiKey.txt').read()
print(api_key)

_marGsCLZyWKZ8ojyxpF

In [4]:
df_AK = quandl.get('FMAC/HPI_AK', authtoken= api_key)
print(df_AK.head())

                Value
Date
1975-01-31  34.371830
1975-02-28  34.880945
1975-03-31  35.402217
1975-04-30  35.944703
1975-05-31  36.535272

In [5]:
df_list = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')

In [6]:
print(df_list)

[         0              1               2               3                  4
0   Sl no.  Abbreviations      State Name         Capital     Became a State
1        1             AL         Alabama      Montgomery  December 14, 1819
2        2             AK          Alaska          Juneau    January 3, 1959
3        3             AZ         Arizona         Phoenix  February 14, 1912
4        4             AR        Arkansas     Little Rock      June 15, 1836
5        5             CA      California      Sacramento  September 9, 1850
6        6             CO        Colorado          Denver     August 1, 1876
7        7             CT     Connecticut        Hartford    January 9, 1788
8        8             DE        Delaware           Dover   December 7, 1787
9        9             FL         Florida     Tallahassee      March 3, 1845
10      10             GA         Georgia         Atlanta    January 2, 1788
11      11             HI          Hawaii        Honolulu    August 21, 1959
12      12             ID           Idaho           Boise       July 3, 1890
13      13             IL        Illinois     Springfield   December 3, 1818
14      14             IN         Indiana    Indianapolis  December 11, 1816
15      15             IA            Iowa      Des Moines  December 28, 1846
16      16             KS          Kansas          Topeka   January 29, 1861
17      17             KY        Kentucky       Frankfort       June 1, 1792
18      18             LA       Louisiana     Baton Rouge     April 30, 1812
19      19             ME           Maine         Augusta     March 15, 1820
20      20             MD        Maryland       Annapolis     April 28, 1788
21      21             MA   Massachusetts          Boston   February 6, 1788
22      22             MI        Michigan         Lansing   January 26, 1837
23      23             MN       Minnesota      Saint Paul       May 11, 1858
24      24             MS     Mississippi         Jackson  December 10, 1817
25      25             MO        Missouri  Jefferson City    August 10, 1821
26      26             MT         Montana          Helena   November 8, 1889
27      27             NE        Nebraska         Lincoln      March 1, 1867
28      28             NV          Nevada     Carson City   October 31, 1864
29      29             NH   New Hampshire         Concord      June 21, 1788
30      30             NJ      New Jersey         Trenton  December 18, 1787
31      31             NM      New Mexico        Santa Fe    January 6, 1912
32      32             NY        New York          Albany      July 26, 1788
33      33             NC  North Carolina         Raleigh  November 21, 1789
34      34             ND    North Dakota        Bismarck   November 2, 1889
35      35             OH            Ohio        Columbus      March 1, 1803
36      36             OK        Oklahoma   Oklahoma City  November 16, 1907
37      37             OR          Oregon           Salem  February 14, 1859
38      38             PA    Pennsylvania      Harrisburg  December 12, 1787
39      39             RI    Rhode Island      Providence       May 19, 1790
40      40             SC  South Carolina        Columbia       May 23, 1788
41      41             SD    South Dakota          Pierre   November 2, 1889
42      42             TN       Tennessee       Nashville       June 1, 1796
43      43             TX           Texas          Austin  December 29, 1845
44      44             UT            Utah  Salt Lake City    January 4, 1896
45      45             VT         Vermont      Montpelier      March 4, 1791
46      46             VA        Virginia        Richmond      June 25, 1788
47      47             WA      Washington         Olympia  November 11, 1889
48      48             WV   West Virginia      Charleston      June 20, 1863
49      49             WI       Wisconsin         Madison       May 29, 1848
50      50             WY         Wyoming        Cheyenne      July 10, 1890,                                              0  \
0  vtePolitical divisions of the United States
1                                       States
2                             Federal district
3                                Insular areas
4                             Outlying islands

                                                   1
0                                                NaN
1  Alabama Alaska Arizona Arkansas California Col...
2                                   Washington, D.C.
3  American Samoa Guam Northern Mariana Islands P...
4  Baker Island Howland Island Jarvis Island John...  ]

In [7]:
print(df_list[0])

         0              1               2               3                  4
0   Sl no.  Abbreviations      State Name         Capital     Became a State
1        1             AL         Alabama      Montgomery  December 14, 1819
2        2             AK          Alaska          Juneau    January 3, 1959
3        3             AZ         Arizona         Phoenix  February 14, 1912
4        4             AR        Arkansas     Little Rock      June 15, 1836
5        5             CA      California      Sacramento  September 9, 1850
6        6             CO        Colorado          Denver     August 1, 1876
7        7             CT     Connecticut        Hartford    January 9, 1788
8        8             DE        Delaware           Dover   December 7, 1787
9        9             FL         Florida     Tallahassee      March 3, 1845
10      10             GA         Georgia         Atlanta    January 2, 1788
11      11             HI          Hawaii        Honolulu    August 21, 1959
12      12             ID           Idaho           Boise       July 3, 1890
13      13             IL        Illinois     Springfield   December 3, 1818
14      14             IN         Indiana    Indianapolis  December 11, 1816
15      15             IA            Iowa      Des Moines  December 28, 1846
16      16             KS          Kansas          Topeka   January 29, 1861
17      17             KY        Kentucky       Frankfort       June 1, 1792
18      18             LA       Louisiana     Baton Rouge     April 30, 1812
19      19             ME           Maine         Augusta     March 15, 1820
20      20             MD        Maryland       Annapolis     April 28, 1788
21      21             MA   Massachusetts          Boston   February 6, 1788
22      22             MI        Michigan         Lansing   January 26, 1837
23      23             MN       Minnesota      Saint Paul       May 11, 1858
24      24             MS     Mississippi         Jackson  December 10, 1817
25      25             MO        Missouri  Jefferson City    August 10, 1821
26      26             MT         Montana          Helena   November 8, 1889
27      27             NE        Nebraska         Lincoln      March 1, 1867
28      28             NV          Nevada     Carson City   October 31, 1864
29      29             NH   New Hampshire         Concord      June 21, 1788
30      30             NJ      New Jersey         Trenton  December 18, 1787
31      31             NM      New Mexico        Santa Fe    January 6, 1912
32      32             NY        New York          Albany      July 26, 1788
33      33             NC  North Carolina         Raleigh  November 21, 1789
34      34             ND    North Dakota        Bismarck   November 2, 1889
35      35             OH            Ohio        Columbus      March 1, 1803
36      36             OK        Oklahoma   Oklahoma City  November 16, 1907
37      37             OR          Oregon           Salem  February 14, 1859
38      38             PA    Pennsylvania      Harrisburg  December 12, 1787
39      39             RI    Rhode Island      Providence       May 19, 1790
40      40             SC  South Carolina        Columbia       May 23, 1788
41      41             SD    South Dakota          Pierre   November 2, 1889
42      42             TN       Tennessee       Nashville       June 1, 1796
43      43             TX           Texas          Austin  December 29, 1845
44      44             UT            Utah  Salt Lake City    January 4, 1896
45      45             VT         Vermont      Montpelier      March 4, 1791
46      46             VA        Virginia        Richmond      June 25, 1788
47      47             WA      Washington         Olympia  November 11, 1889
48      48             WV   West Virginia      Charleston      June 20, 1863
49      49             WI       Wisconsin         Madison       May 29, 1848
50      50             WY         Wyoming        Cheyenne      July 10, 1890

In [54]:
print(df_list[0][1])
import pickle

0     Abbreviations
1                AL
2                AK
3                AZ
4                AR
5                CA
6                CO
7                CT
8                DE
9                FL
10               GA
11               HI
12               ID
13               IL
14               IN
15               IA
16               KS
17               KY
18               LA
19               ME
20               MD
21               MA
22               MI
23               MN
24               MS
25               MO
26               MT
27               NE
28               NV
29               NH
30               NJ
31               NM
32               NY
33               NC
34               ND
35               OH
36               OK
37               OR
38               PA
39               RI
40               SC
41               SD
42               TN
43               TX
44               UT
45               VT
46               VA
47               WA
48               WV
49               WI
50               WY
Name: 1, dtype: object

In [56]:
def retrieve_initialStateData():
    states = statelist()
    main_df1 = pd.DataFrame()
    for abbv in df_list[0][1][1:]:
        query='FMAC/HPI_'+abbv
        dfM = quandl.get(query, authtoken = api_key)
        if main_df1.empty:
            main_df1=dfM
        else:
            main_df1 = main_df1.join(dfM)
    print(main_df1.head())
    
    pickle_out = open('picky.pickle','wb')
    pickle.dump(main_df1,pickle_out)
    pickle_out.close()
    
retrieve_initialStateData()

ValueError: columns overlap but no suffix specified: Index(['Value'], dtype='object')

In [10]:
print(newdf.head())

                Value
Date
1975-01-31  31.668794
1975-02-28  32.161920
1975-03-31  32.680525
1975-04-30  33.210124
1975-05-31  33.714128

In [11]:
df11 = pd.DataFrame({'Year':[2001,2002,2003,2004],'UnEmployment':[23,12,1,24],'growth':[1,3,5,7]})
df12 = pd.DataFrame({'Year':[2001,2004,2005,2006],'underDeveloped':[21,20,8,1],'caliber':[10,23,45,70]})

In [12]:
merged = pd.merge(df11,df12, on='Year', how='left')

In [13]:
print(merged)

   Year  UnEmployment  growth  underDeveloped  caliber
0  2001            23       1            21.0     10.0
1  2002            12       3             NaN      NaN
2  2003             1       5             NaN      NaN
3  2004            24       7            20.0     23.0

In [14]:
concat = pd.concat([df11,df12])

/Users/pagidoju/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

In [15]:
print(concat)

   UnEmployment  Year  caliber  growth  underDeveloped
0          23.0  2001      NaN     1.0             NaN
1          12.0  2002      NaN     3.0             NaN
2           1.0  2003      NaN     5.0             NaN
3          24.0  2004      NaN     7.0             NaN
0           NaN  2001     10.0     NaN            21.0
1           NaN  2004     23.0     NaN            20.0
2           NaN  2005     45.0     NaN             8.0
3           NaN  2006     70.0     NaN             1.0

In [16]:
concat.head()

   UnEmployment  Year  caliber  growth  underDeveloped
0          23.0  2001      NaN     1.0             NaN
1          12.0  2002      NaN     3.0             NaN
2           1.0  2003      NaN     5.0             NaN
3          24.0  2004      NaN     7.0             NaN
0           NaN  2001     10.0     NaN            21.0

In [17]:
df11.append(df12)

/Users/pagidoju/anaconda3/lib/python3.6/site-packages/pandas/core/frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

   UnEmployment  Year  caliber  growth  underDeveloped
0          23.0  2001      NaN     1.0             NaN
1          12.0  2002      NaN     3.0             NaN
2           1.0  2003      NaN     5.0             NaN
3          24.0  2004      NaN     7.0             NaN
0           NaN  2001     10.0     NaN            21.0
1           NaN  2004     23.0     NaN            20.0
2           NaN  2005     45.0     NaN             8.0
3           NaN  2006     70.0     NaN             1.0

In [18]:
import pickle

In [40]:
def statelist():
    df_statesList = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')
    return df_statesList[0][1][1:]

In [41]:
statelist()

1     AL
2     AK
3     AZ
4     AR
5     CA
6     CO
7     CT
8     DE
9     FL
10    GA
11    HI
12    ID
13    IL
14    IN
15    IA
16    KS
17    KY
18    LA
19    ME
20    MD
21    MA
22    MI
23    MN
24    MS
25    MO
26    MT
27    NE
28    NV
29    NH
30    NJ
31    NM
32    NY
33    NC
34    ND
35    OH
36    OK
37    OR
38    PA
39    RI
40    SC
41    SD
42    TN
43    TX
44    UT
45    VT
46    VA
47    WA
48    WV
49    WI
50    WY
Name: 1, dtype: object

In [63]:
def retrieve_initialStateData():
    states = statelist()
    main_df1 = pd.DataFrame()
    
    for abbv1 in states:
        query1 = 'FMAC/HPI_'+ abbv1
        print(query1)
        dfM = quandl.get(query1, authtoken= api_key)
        
        if main_df1.empty:
            main_df1=dfM
            print(main_df1)
        else:
            main_df1 = main_df1.merge(dfM)
            print(main_df1)
    print(main_df1.head())
    
    pickle_out = open('fiddyStates1.pickle','wb')
    pickle.dump(main_df1,pickle_out)
    pickle_out.close()

In [64]:
retrieve_initialStateData()

FMAC/HPI_AL
                 Value
Date
1975-01-31   35.695975
1975-02-28   35.896770
1975-03-31   36.133518
1975-04-30   36.425723
1975-05-31   36.695708
1975-06-30   36.823713
1975-07-31   36.747060
1975-08-31   36.511773
1975-09-30   36.255136
1975-10-31   36.139294
1975-11-30   36.247464
1975-12-31   36.592162
1976-01-31   37.138285
1976-02-29   37.756437
1976-03-31   38.276319
1976-04-30   38.596135
1976-05-31   38.740517
1976-06-30   38.797231
1976-07-31   38.856955
1976-08-31   38.918701
1976-09-30   38.958368
1976-10-31   39.018758
1976-11-30   39.159408
1976-12-31   39.316048
1977-01-31   39.393664
1977-02-28   39.416713
1977-03-31   39.450967
1977-04-30   39.609241
1977-05-31   39.921331
1977-06-30   40.340456
...                ...
2015-07-31  127.854262
2015-08-31  127.845969
2015-09-30  127.319078
2015-10-31  126.705007
2015-11-30  126.273111
2015-12-31  126.028940
2016-01-31  126.252948
2016-02-29  127.029795
2016-03-31  128.128436
2016-04-30  129.498282
2016-05-31  130.839220
2016-06-30  131.902611
2016-07-31  132.731896
2016-08-31  133.123014
2016-09-30  132.944681
2016-10-31  132.231221
2016-11-30  131.451951
2016-12-31  131.060867
2017-01-31  131.261240
2017-02-28  132.227038
2017-03-31  133.824067
2017-04-30  135.561296
2017-05-31  136.832165
2017-06-30  137.306662
2017-07-31  137.053164
2017-08-31  136.832464
2017-09-30  137.182469
2017-10-31  137.690921
2017-11-30  137.905915
2017-12-31  138.465286

[516 rows x 1 columns]
FMAC/HPI_AK
   Value
0  100.0
FMAC/HPI_AZ
   Value
0  100.0
FMAC/HPI_AR
   Value
0  100.0
FMAC/HPI_CA
   Value
0  100.0
FMAC/HPI_CO
   Value
0  100.0
FMAC/HPI_CT
   Value
0  100.0
FMAC/HPI_DE
   Value
0  100.0
FMAC/HPI_FL
   Value
0  100.0
FMAC/HPI_GA
   Value
0  100.0
FMAC/HPI_HI
   Value
0  100.0
FMAC/HPI_ID
   Value
0  100.0
FMAC/HPI_IL
   Value
0  100.0
FMAC/HPI_IN
   Value
0  100.0
FMAC/HPI_IA
   Value
0  100.0
FMAC/HPI_KS
   Value
0  100.0
FMAC/HPI_KY
   Value
0  100.0
FMAC/HPI_LA
   Value
0  100.0
FMAC/HPI_ME
   Value
0  100.0
FMAC/HPI_MD
   Value
0  100.0
FMAC/HPI_MA
   Value
0  100.0
FMAC/HPI_MI
   Value
0  100.0
FMAC/HPI_MN
   Value
0  100.0
FMAC/HPI_MS
   Value
0  100.0
FMAC/HPI_MO
   Value
0  100.0
FMAC/HPI_MT
   Value
0  100.0
FMAC/HPI_NE
   Value
0  100.0
FMAC/HPI_NV
   Value
0  100.0
FMAC/HPI_NH
   Value
0  100.0
FMAC/HPI_NJ
   Value
0  100.0
FMAC/HPI_NM
   Value
0  100.0
FMAC/HPI_NY
   Value
0  100.0
FMAC/HPI_NC
   Value
0  100.0
FMAC/HPI_ND
   Value
0  100.0
FMAC/HPI_OH
   Value
0  100.0
FMAC/HPI_OK
   Value
0  100.0
FMAC/HPI_OR
   Value
0  100.0
FMAC/HPI_PA
   Value
0  100.0
FMAC/HPI_RI
   Value
0  100.0
FMAC/HPI_SC
   Value
0  100.0
FMAC/HPI_SD
   Value
0  100.0
FMAC/HPI_TN
   Value
0  100.0
FMAC/HPI_TX
   Value
0  100.0
FMAC/HPI_UT
   Value
0  100.0
FMAC/HPI_VT
   Value
0  100.0
FMAC/HPI_VA
   Value
0  100.0
FMAC/HPI_WA
   Value
0  100.0
FMAC/HPI_WV
   Value
0  100.0
FMAC/HPI_WI
   Value
0  100.0
FMAC/HPI_WY
   Value
0  100.0
   Value
0  100.0

In [65]:
pickle_in = open('fiddyStates1.pickle','rb')
newData = pickle.load(pickle_in)
print(newData)

   Value
0  100.0

In [66]:
newData.to_pickle('newPickle.pickle')

In [67]:
newData2 = pd.read_pickle('newPickle.pickle')
print(newData2)

   Value
0  100.0